---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorCalculatingPressure
source: html/6a982d21-12e3-da18-e9ee-64e14df192b9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorCalculatingPressure Property

The pressure calculation could not be performed.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkErrorCalculatingPressure { get; }
```